src/test/jmeter/OptimisticRequest.jmx
<?xml version="1.0" encoding="UTF-8"?>
<jmeterTestPlan version="1.2" properties="3.2" jmeter="3.2 r1790748">
  <hashTree>
    <TestPlan guiclass="TestPlanGui" testclass="TestPlan" testname="Plan testów" enabled="true">
      <boolProp name="TestPlan.functional_mode">false</boolProp>
      <boolProp name="TestPlan.serialize_threadgroups">false</boolProp>
      <elementProp name="TestPlan.user_defined_variables" elementType="Arguments" guiclass="ArgumentsPanel" testclass="Arguments" testname="Zmienne zdefiniowane przez użytkownika" enabled="true">
        <collectionProp name="Arguments.arguments">
          <elementProp name="replicas" elementType="Argument">
            <stringProp name="Argument.name">replicas</stringProp>
            <stringProp name="Argument.value">${__P(replicas)}</stringProp>
            <stringProp name="Argument.metadata">=</stringProp>
          </elementProp>
          <elementProp name="paxosProcesses" elementType="Argument">
            <stringProp name="Argument.name">paxosProcesses</stringProp>
            <stringProp name="Argument.value">${__P(paxosProcesses)}</stringProp>
            <stringProp name="Argument.metadata">=</stringProp>
          </elementProp>
          <elementProp name="numberOfReadsInQuery" elementType="Argument">
            <stringProp name="Argument.name">numberOfReadsInQuery</stringProp>
            <stringProp name="Argument.value">${__P(numberOfReadsInQuery)}</stringProp>
            <stringProp name="Argument.metadata">=</stringProp>
          </elementProp>
          <elementProp name="delayInMillis" elementType="Argument">
            <stringProp name="Argument.name">delayInMillis</stringProp>
            <stringProp name="Argument.value">${__P(delayInMillis,0)}</stringProp>
            <stringProp name="Argument.metadata">=</stringProp>
          </elementProp>
          <elementProp name="numberOfKeys" elementType="Argument">
            <stringProp name="Argument.name">numberOfKeys</stringProp>
            <stringProp name="Argument.value">${__P(numberOfKeys)}</stringProp>
            <stringProp name="Argument.metadata">=</stringProp>
          </elementProp>
          <elementProp name="numberOfReads" elementType="Argument">
            <stringProp name="Argument.name">numberOfReads</stringProp>
            <stringProp name="Argument.value">${__P(numberOfReads)}</stringProp>
            <stringProp name="Argument.metadata">=</stringProp>
          </elementProp>
          <elementProp name="numberOfWrites" elementType="Argument">
            <stringProp name="Argument.name">numberOfWrites</stringProp>
            <stringProp name="Argument.value">${__P(numberOfWrites)}</stringProp>
            <stringProp name="Argument.metadata">=</stringProp>
          </elementProp>
          <elementProp name="randomDelayInMillis" elementType="Argument">
            <stringProp name="Argument.name">randomDelayInMillis</stringProp>
            <stringProp name="Argument.value">${__P(randomDelayInMillis,0)}</stringProp>
            <stringProp name="Argument.metadata">=</stringProp>
          </elementProp>
          <elementProp name="numberOfClientThreads" elementType="Argument">
            <stringProp name="Argument.name">numberOfClientThreads</stringProp>
            <stringProp name="Argument.value">${__P(numberOfClientThreads,0)}</stringProp>
            <stringProp name="Argument.metadata">=</stringProp>
          </elementProp>
        </collectionProp>
      </elementProp>
    </TestPlan>
    <hashTree>
      <Arguments guiclass="ArgumentsPanel" testclass="Arguments" testname="Zmienne zdefiniowane przez użytkownika" enabled="true">
        <collectionProp name="Arguments.arguments">
          <elementProp name="replicas" elementType="Argument">
            <stringProp name="Argument.name">replicas</stringProp>
            <stringProp name="Argument.value">${__P(replicas)}</stringProp>
            <stringProp name="Argument.metadata">=</stringProp>
          </elementProp>
          <elementProp name="paxosProcesses" elementType="Argument">
            <stringProp name="Argument.name">paxosProcesses</stringProp>
            <stringProp name="Argument.value">${__P(paxosProcesses)}</stringProp>
            <stringProp name="Argument.metadata">=</stringProp>
          </elementProp>
          <elementProp name="numberOfReadsInQuery" elementType="Argument">
            <stringProp name="Argument.name">numberOfReadsInQuery</stringProp>
            <stringProp name="Argument.value">${__P(numberOfReadsInQuery)}</stringProp>
            <stringProp name="Argument.metadata">=</stringProp>
          </elementProp>
          <elementProp name="delayInMillis" elementType="Argument">
            <stringProp name="Argument.name">delayInMillis</stringProp>
            <stringProp name="Argument.value">${__P(delayInMillis,0)}</stringProp>
            <stringProp name="Argument.metadata">=</stringProp>
          </elementProp>
          <elementProp name="numberOfKeys" elementType="Argument">
            <stringProp name="Argument.name">numberOfKeys</stringProp>
            <stringProp name="Argument.value">${__P(numberOfKeys)}</stringProp>
            <stringProp name="Argument.metadata">=</stringProp>
          </elementProp>
          <elementProp name="numberOfReads" elementType="Argument">
            <stringProp name="Argument.name">numberOfReads</stringProp>
            <stringProp name="Argument.value">${__P(numberOfReads)}</stringProp>
            <stringProp name="Argument.metadata">=</stringProp>
          </elementProp>
          <elementProp name="numberOfWrites" elementType="Argument">
            <stringProp name="Argument.name">numberOfWrites</stringProp>
            <stringProp name="Argument.value">${__P(numberOfWrites)}</stringProp>
            <stringProp name="Argument.metadata">=</stringProp>
          </elementProp>
          <elementProp name="randomDelayInMillis" elementType="Argument">
            <stringProp name="Argument.name">randomDelayInMillis</stringProp>
            <stringProp name="Argument.value">${__P(randomDelayInMillis,0)}</stringProp>
            <stringProp name="Argument.metadata">=</stringProp>
          </elementProp>
          <elementProp name="numberOfClientThreads" elementType="Argument">
            <stringProp name="Argument.name">numberOfClientThreads</stringProp>
            <stringProp name="Argument.value">${__P(numberOfClientThreads,0)}</stringProp>
            <stringProp name="Argument.metadata">=</stringProp>
          </elementProp>
        </collectionProp>
      </Arguments>
      <hashTree/>
      <ThreadGroup guiclass="ThreadGroupGui" testclass="ThreadGroup" testname="Grupa wątków" enabled="true">
        <stringProp name="ThreadGroup.on_sample_error">continue</stringProp>
        <elementProp name="ThreadGroup.main_controller" elementType="LoopController" guiclass="LoopControlPanel" testclass="LoopController" testname="Loop Controller" enabled="true">
          <boolProp name="LoopController.continue_forever">false</boolProp>
          <stringProp name="LoopController.loops">1</stringProp>
        </elementProp>
        <stringProp name="ThreadGroup.num_threads">${__P(roThreads,1)}</stringProp>
        <stringProp name="ThreadGroup.ramp_time">${__P(rampUp,5)}</stringProp>
        <longProp name="ThreadGroup.start_time">1502287720000</longProp>
        <longProp name="ThreadGroup.end_time">1502287720000</longProp>
        <boolProp name="ThreadGroup.scheduler">false</boolProp>
        <stringProp name="ThreadGroup.duration">210</stringProp>
      </ThreadGroup>
      <hashTree>
        <JavaSampler guiclass="JavaTestSamplerGui" testclass="JavaSampler" testname="RO Request" enabled="true">
          <elementProp name="arguments" elementType="Arguments" guiclass="ArgumentsPanel" testclass="Arguments" enabled="true">
            <collectionProp name="Arguments.arguments">
              <elementProp name="replicas" elementType="Argument">
                <stringProp name="Argument.name">replicas</stringProp>
                <stringProp name="Argument.value">${replicas}</stringProp>
                <stringProp name="Argument.metadata">=</stringProp>
              </elementProp>
              <elementProp name="paxosProcesses" elementType="Argument">
                <stringProp name="Argument.name">paxosProcesses</stringProp>
                <stringProp name="Argument.value">${paxosProcesses}</stringProp>
                <stringProp name="Argument.metadata">=</stringProp>
              </elementProp>
              <elementProp name="numberOfReadsInQuery" elementType="Argument">
                <stringProp name="Argument.name">numberOfReadsInQuery</stringProp>
                <stringProp name="Argument.value">${numberOfReadsInQuery}</stringProp>
                <stringProp name="Argument.metadata">=</stringProp>
              </elementProp>
              <elementProp name="delayInMillis" elementType="Argument">
                <stringProp name="Argument.name">delayInMillis</stringProp>
                <stringProp name="Argument.value">${delayInMillis}</stringProp>
                <stringProp name="Argument.metadata">=</stringProp>
              </elementProp>
              <elementProp name="randomDelayInMillis" elementType="Argument">
                <stringProp name="Argument.name">randomDelayInMillis</stringProp>
                <stringProp name="Argument.value">${randomDelayInMillis}</stringProp>
                <stringProp name="Argument.metadata">=</stringProp>
              </elementProp>
              <elementProp name="numberOfKeys" elementType="Argument">
                <stringProp name="Argument.name">numberOfKeys</stringProp>
                <stringProp name="Argument.value">${numberOfKeys}</stringProp>
                <stringProp name="Argument.metadata">=</stringProp>
              </elementProp>
              <elementProp name="numberOfClientThreads" elementType="Argument">
                <stringProp name="Argument.name">numberOfClientThreads</stringProp>
                <stringProp name="Argument.value">${numberOfClientThreads}</stringProp>
                <stringProp name="Argument.metadata">=</stringProp>
              </elementProp>
            </collectionProp>
          </elementProp>
          <stringProp name="classname">org.szymie.benchmark.OptimisticROJMeterRequest</stringProp>
        </JavaSampler>
        <hashTree/>
      </hashTree>
      <ThreadGroup guiclass="ThreadGroupGui" testclass="ThreadGroup" testname="Grupa wątków" enabled="true">
        <stringProp name="ThreadGroup.on_sample_error">continue</stringProp>
        <elementProp name="ThreadGroup.main_controller" elementType="LoopController" guiclass="LoopControlPanel" testclass="LoopController" testname="Loop Controller" enabled="true">
          <boolProp name="LoopController.continue_forever">false</boolProp>
          <stringProp name="LoopController.loops">1</stringProp>
        </elementProp>
        <stringProp name="ThreadGroup.num_threads">${__P(rwThreads,1)}</stringProp>
        <stringProp name="ThreadGroup.ramp_time">${__P(rampUp,5)}</stringProp>
        <longProp name="ThreadGroup.start_time">1503155743000</longProp>
        <longProp name="ThreadGroup.end_time">1503155743000</longProp>
        <boolProp name="ThreadGroup.scheduler">false</boolProp>
        <stringProp name="ThreadGroup.duration">210</stringProp>
      </ThreadGroup>
      <hashTree>
        <JavaSampler guiclass="JavaTestSamplerGui" testclass="JavaSampler" testname="RW Request" enabled="true">
          <elementProp name="arguments" elementType="Arguments" guiclass="ArgumentsPanel" testclass="Arguments" enabled="true">
            <collectionProp name="Arguments.arguments">
              <elementProp name="replicas" elementType="Argument">
                <stringProp name="Argument.name">replicas</stringProp>
                <stringProp name="Argument.value">${replicas}</stringProp>
                <stringProp name="Argument.metadata">=</stringProp>
              </elementProp>
              <elementProp name="paxosProcesses" elementType="Argument">
                <stringProp name="Argument.name">paxosProcesses</stringProp>
                <stringProp name="Argument.value">${paxosProcesses}</stringProp>
                <stringProp name="Argument.metadata">=</stringProp>
              </elementProp>
              <elementProp name="numberOfReads" elementType="Argument">
                <stringProp name="Argument.name">numberOfReads</stringProp>
                <stringProp name="Argument.value">${numberOfReads}</stringProp>
                <stringProp name="Argument.metadata">=</stringProp>
              </elementProp>
              <elementProp name="numberOfWrites" elementType="Argument">
                <stringProp name="Argument.name">numberOfWrites</stringProp>
                <stringProp name="Argument.value">${numberOfWrites}</stringProp>
                <stringProp name="Argument.metadata">=</stringProp>
              </elementProp>
              <elementProp name="delayInMillis" elementType="Argument">
                <stringProp name="Argument.name">delayInMillis</stringProp>
                <stringProp name="Argument.value">${delayInMillis}</stringProp>
                <stringProp name="Argument.metadata">=</stringProp>
              </elementProp>
              <elementProp name="randomDelayInMillis" elementType="Argument">
                <stringProp name="Argument.name">randomDelayInMillis</stringProp>
                <stringProp name="Argument.value">${randomDelayInMillis}</stringProp>
                <stringProp name="Argument.metadata">=</stringProp>
              </elementProp>
              <elementProp name="numberOfKeys" elementType="Argument">
                <stringProp name="Argument.name">numberOfKeys</stringProp>
                <stringProp name="Argument.value">${numberOfKeys}</stringProp>
                <stringProp name="Argument.metadata">=</stringProp>
              </elementProp>
              <elementProp name="numberOfClientThreads" elementType="Argument">
                <stringProp name="Argument.name">numberOfClientThreads</stringProp>
                <stringProp name="Argument.value">${numberOfClientThreads}</stringProp>
                <stringProp name="Argument.metadata">=</stringProp>
              </elementProp>
            </collectionProp>
          </elementProp>
          <stringProp name="classname">org.szymie.benchmark.OptimisticRWJMeterRequest</stringProp>
        </JavaSampler>
        <hashTree/>
      </hashTree>
      <ResultCollector guiclass="SummaryReport" testclass="ResultCollector" testname="Summary Report" enabled="false">
        <boolProp name="ResultCollector.error_logging">false</boolProp>
        <stringProp name="filename">/home/szymie/Pobrane/apache-jmeter-3.2/bin/out_70v2.csv</stringProp>
      </ResultCollector>
      <hashTree/>
      <ResultCollector guiclass="SimpleDataWriter" testclass="ResultCollector" testname="Simple Data Writer" enabled="true">
        <boolProp name="ResultCollector.error_logging">false</boolProp>
        <stringProp name="filename">out.csv</stringProp>
      </ResultCollector>
      <hashTree/>
    </hashTree>
    <WorkBench guiclass="WorkBenchGui" testclass="WorkBench" testname="Brudnopis" enabled="true">
      <boolProp name="WorkBench.save">true</boolProp>
    </WorkBench>
    <hashTree/>
  </hashTree>
</jmeterTestPlan>